

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("РедакторФорм") Тогда
		ИмяПодключеннойОбработки = ЭтаФорма.Параметры.РедакторФорм.ИмяПодключеннойОбработки;
		Если ЭтаФорма.Параметры.РедакторФорм.ЗапущенаКакВнешняя Тогда
					ОбъектОписанияЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
		ОбъектОписанияЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
			//ВнешниеОбработки.Создать(ИмяПодключеннойОбработки, Ложь).ПодготовитьДанныеАнализируемойФормы(ЭтаФорма);
			АдресВнешнейОбработкиВоВременномХранилище =  ЭтаФорма.Параметры.РедакторФорм.АдресВнешнейОбработкиВоВременномХранилище;
			ИмяОбработки = ВнешниеОбработки.Подключить(АдресВнешнейОбработкиВоВременномХранилище, "ВременнаяОбработкаПолученияФормыПалитры"+Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ="),  Ложь, ОбъектОписанияЗащиты);
			ВнешниеОбработки.Создать(ИмяОбработки, Ложь).ПодготовитьДанныеАнализируемойФормы(ЭтаФорма);
			//ИмяОбработки = ПереподключитьОбработку(АдресХранилища);
			//ПолучитьФорму("ВнешняяОбработка."+ ИмяОбработки +".Форма.ФормаПалитра", ПараметрыФормы);
		Иначе
			Обработки[ИмяПодключеннойОбработки].Создать().ПодготовитьДанныеАнализируемойФормы(ЭтаФорма);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
